## How to rename DataFrame columns?

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Dataset/PersonalInfo.csv')
df.head()

   Sr_No      Name  Gender  Age       City
0      1  Rajendra    Male   40       Pune
1      2     Meena  Female   32  Hyderabad
2      3    Aarohi  Female   25       Pune
3      4     Aarav    Male   20     Mumbai
4      5   Aarushi  Female   12  Hyderabad

In [3]:
df.columns

Index(['Sr_No', 'Name', 'Gender', 'Age', 'City'], dtype='object')

In [4]:
df.rename(columns = {'Sr_No':'SrNo'}, inplace=True)

In [5]:
df.columns

Index(['SrNo', 'Name', 'Gender', 'Age', 'City'], dtype='object')

In [6]:
df.head()

   SrNo      Name  Gender  Age       City
0     1  Rajendra    Male   40       Pune
1     2     Meena  Female   32  Hyderabad
2     3    Aarohi  Female   25       Pune
3     4     Aarav    Male   20     Mumbai
4     5   Aarushi  Female   12  Hyderabad

In [9]:
df.columns = df.columns.str.lower()
df.head()

   srno      name  gender  age       city
0     1  Rajendra    Male   40       Pune
1     2     Meena  Female   32  Hyderabad
2     3    Aarohi  Female   25       Pune
3     4     Aarav    Male   20     Mumbai
4     5   Aarushi  Female   12  Hyderabad